#+title: BootstrapVirasoro Documentation
#+author: Paul ROUX
#+setupfile: /Users/Paul/.doom.d/setupfiles/org-html-themes/org/theme-readtheorg-local.setup
#+setupfile: ~/.doom.d/setupfiles/org-basic-latex-export.org
#+options: toc:3 num:2
#+property: header_args: :eval never-export
#+startup: folded

** Relation between sphere four-point blocks and torus one-point blocks
:properties:
:header-args:julia: :session test
:end:

The recursion formulas for torus one-point blocks and sphere four-point blocks imply that four point blocks on the sphere are related to one-point blocks on the torus through the relation

\begin{align}
H^{\text{torus}}_{P}(\tau, c | P_{1} | q^{2}) = H_{\sqrt{2}P}\left(c' \left|\left. P_{(0,\frac12)}, \frac{P_{1}}{\sqrt{2}}, P_{(0,\frac12)}, P_{(0,\frac12)} \right.\right| q \right)
\end{align}

where
+ $c'$ is related to $c$ via $\beta'=\frac\beta{\sqrt 2}$.
+ Fields on the RHS have dimensions $\Delta = \frac{c'-1}{24} - P^2$.

Our code successfully reproduces this relation:

#+begin_src julia :results silent
import Pkg; Pkg.activate(".")
using BootstrapVirasoro, BenchmarkTools, EllipticFunctions
import BootstrapVirasoro.FourPointBlocksSphere.qfromx
q = BootstrapVirasoro.FourPointBlocksSphere.qfromx(0.05)

left=1;
right=2;
c_torus = CentralCharge(:b, 1.2+.1*1im);
c_sphere = CentralCharge(:b, (1.2+.1*1im)/sqrt(2))

P = 0.23+.11im
P1 = 0.41+1.03im
V_torus_chan = Field(c_torus, :P, P, diagonal=true)
δ_torus = V_torus_chan.δ[left]
δ11_torus = Field(c_torus, Kac=true, r=1, s=1, diagonal=true).δ[left]
V_torus_ext = Field(c_torus, :P, P1, diagonal=true)
corr_torus = OnePointCorrelation

V_sphere_chan = Field(c_sphere, :P, sqrt(2)*P, diagonal=true)
δ_sphere = V_sphere_chan.δ[left]
δ21_sphere = Field(c_sphere, Kac=true, r=2, s=1, diagonal=true).δ[left]
δ12_sphere = Field(c_sphere, Kac=true, r=1, s=2, diagonal=true).δ[left]
V_sphere_ext = Field(c_sphere, :P, P1/sqrt(2), diagonal=true)
VKac_sphere = Field(c_sphere, Kac=true, r=0, s=1//2, diagonal=true)

corr_torus = OnePointCorrelation(c_torus, V_torus_ext)
block_torus = OnePointBlockTorus(V_torus_chan)

corr_sphere = FourPointCorrelation(c_sphere, [VKac_sphere, V_sphere_ext, VKac_sphere,VKac_sphere])
block_sphere = FourPointBlockSphere(:s, V_sphere_chan)

h1 = BootstrapVirasoro.OnePointBlocksTorus.H(q^2, 5, block_torus, corr_torus, left)
h2 = BootstrapVirasoro.FourPointBlocksSphere.H(q, 5, block_sphere, corr_sphere, left)
#+end_src

#+begin_src julia :results output raw
println("torus block = $h1")
println("sphere block = $h2")
#+end_src

#+RESULTS:
torus block = 1.0000059915273005 - 1.1912765043504052e-5im
sphere block = 1.000005991527301 - 1.1912765042311957e-5im

** Development tests
:PROPERTIES:
:header-args:julia: :tangle ./test/devtests.jl :session test
:END:

#+begin_src julia :results silent
import Pkg; Pkg.activate(".")
using BootstrapVirasoro
#+end_src

#+begin_src julia :results silent
using BootstrapVirasoro, BenchmarkTools, EllipticFunctions

left=1;
right=2;

c = CentralCharge(:β, big(1.2+.1*1im));
V1 = Field(c, :Δ, 0.23+.11im, diagonal=true);
V2 = Field(c, :Δ, 3.43, diagonal=true);
V3 = Field(c, :Δ, 0.13, diagonal=true);
V4 = Field(c, :Δ, 1.3, diagonal=true);
V = Field(c, :Δ, 0.1, diagonal = true);

x = BigFloat("0.05", RoundUp);
function test()
    corr = FourPointCorrelation(c, V1, V2, V3, V4)
    block = FourPointBlockSphere(:s, V)
    calc = BootstrapVirasoro.FourPointBlocksSphere.block_chiral_schan(x, 20, block, corr, left);
end;
#+end_src

#+begin_src julia :results output :exports both :eval never-export
@btime test()
#+end_src

#+RESULTS:
:   90.034 ms (1095792 allocations: 59.37 MiB)
: 2337.403811916126625122326580582469276291308611169647345129357174845040805086673 + 4771.391284704253687680894658772605764303477461447331028240571631385564211692817im


*** Relation between four-point blocks on the sphere and one-point blocks on the torus

Four point blocks on the sphere are related to one-point blocks on the torus through the relation

\[
\mathcal H^{\text{torus}}_{c, P}(P_{1} | q^{2}) = \mathcal H_{c', \sqrt{2}P'}\left(\left. P'_{(0,\frac12)}, \left(\frac{P_{1}}{\sqrt{2}}\right)', P'_{(0,\frac12)}, P'_{(0,\frac12)} \right| q \right)
\]

where
+ $c'$ is related to $c$ via $\beta'=\frac\beta{\sqrt 2}$.
+ $P'$ denotes the Virasoro module with primary field of dimension $\Delta'(P') = \frac{c'-1}{24} - P'^{2}$

#+begin_src julia :results silent
import Pkg; Pkg.activate(".")
using BootstrapVirasoro, BenchmarkTools, EllipticFunctions

left=1;
right=2;

import BootstrapVirasoro.FourPointBlocksSphere.qfromx
c_torus = CentralCharge(:b, 1.2+.1*1im);
c_sphere = CentralCharge(:b, (1.2+.1*1im)/sqrt(2))

q = BootstrapVirasoro.FourPointBlocksSphere.qfromx(0.05)

P = 0.23+.11im
P1 = 0.41+1.03im
V_torus_chan = Field(c_torus, :P, P, diagonal=true)
δ_torus = V_torus_chan.δ[left]
δ11_torus = Field(c_torus, Kac=true, r=1, s=1, diagonal=true).δ[left]
V_torus_ext = Field(c_torus, :P, P1, diagonal=true)

V_sphere_chan = Field(c_sphere, :P, sqrt(2)*P, diagonal=true)
δ_sphere = V_sphere_chan.δ[left]
δ21_sphere = Field(c_sphere, Kac=true, r=2, s=1, diagonal=true).δ[left]
δ12_sphere = Field(c_sphere, Kac=true, r=1, s=2, diagonal=true).δ[left]
V_sphere_ext = Field(c_sphere, :P, P1/sqrt(2), diagonal=true)
VKac_sphere = Field(c_sphere, Kac=true, r=0, s=1//2, diagonal=true)

corr_torus = OnePointCorrelation(c_torus, V_torus_ext)
block_torus = OnePointBlockTorus(V_torus_chan)

corr_sphere = FourPointCorrelation(c_sphere, [VKac_sphere, V_sphere_ext, VKac_sphere,VKac_sphere])
block_sphere = FourPointBlockSphere(:s, V_sphere_chan)

h1 = BootstrapVirasoro.OnePointBlocksTorus.H(q^2, 5, block_torus, corr_torus, left)
h2 = BootstrapVirasoro.FourPointBlocksSphere.H(q, 5, block_sphere, corr_sphere, left)
#+end_src

#+begin_src julia :results output
println("torus block = $h1 \nsphere block = $h2")
#+end_src

#+RESULTS:
: torus block = 1.0000059915273005 - 1.1912765043504052e-5im
: sphere block = 1.000005991527301 - 1.1912765042311957e-5im
